/*====================================================================*/
/* Объект: план доски для рисования.                                  */
/* Доска  представляет  собой  поле  15 на 19  клеток,  состоящие  из */
/* 20 горизонтальных и 16 вертикальных линий,  которые образуют сетку */
/* из 20 * 15 = 300  горизонтальных   и   16 * 19 = 304  вертикальных */
/* отрезков. Каждый из отрезков может быть либо закрашен, либо нет.   */
/* План  доски  для рисования представляет собой массив состояний 604 */
/* отрезков. Ячейки массива характеризуют чередующиеся горизонтальные */
/* и вертикальные отрезки: true - закрашен, false - нет.              */
/*====================================================================*/
var boardmap = new Object ();
/*=======================================================*/
/* Подготовка к работе с планом.                         */
/* Вызов: nc - количество вертикальных линий (столбцов), */
/*        nr - количество горизонтальных линий (строк).  */
/*=======================================================*/
boardmap.init = function (nc, nr) {
	var n = nr * (nc - 1) + nc * (nr - 1);
	this.nc = nc;
	this.nr = nr;
	this.m = new Array (n);
	this.wash ();
};
/*================*/
/* Очистка плана. */
/*================*/
boardmap.wash = function () {
	var i, n = this.m.length;
	for (i = 0; i < n; i++)
		this.m[i] = false;
};
/*========================================================================*/
/* Вычисление номера ячейки массива плана, описывающей состояние отрезка. */
/* Вызов: c - номер вертикальной линии узла сетки,                        */
/*        r - номер горизонтальной линии узла сетки,                      */
/*        dc - левый (-1) или правый (1) отрезок,                         */
/*        dr - верхний (-1) или нижний (1) отрезок.                       */
/* Возврат: номер ячейки массива, описывающей отрезок.                    */
/*========================================================================*/
boardmap.index = function (c, r, dc, dr) {
	var i = r * (2 * this.nc - 1) + c, di;
	di = dc == -1? -1: dc == 1? 0: dr == -1? -this.nc: dr == 1? this.nc - 1: 0;
};
/*=======================================*/
/* Фиксация нарисованной линии на плане. */
/*=======================================*/
boardmap.drawLine = function (c, r, dc, dr) {
	var i = r * (2 * this.nc - 1) + c, di;
	di = dc == -1? -1: dc == 1? 0: dr == -1? -this.nc: dr == 1? this.nc - 1: 0;
	this.m[i + di] = true;
	/* window.alert ("(" + c + "," + r + ") (" + dc + "," + dr + ")"); */
};
/*===============================================================*/
/* Упаковка плана в строку.                                      */
/* Вызов: abc - алфавит из 64 символов для кодирования значений. */
/* Возврат: строка с упакованным планом.                         */
/*===============================================================*/
boardmap.pack = function (abc) {
	var i = 0, j = 0, w = 1, b = 0,
		n = this.m.length,
		k = Math.ceil (n / 6),
		a = new Array (k);
	while (i < n) {
		if (this.m[i++])
			b += w;
		if (w < 32)
			w *= 2;
		else {
			a[j++] = abc.charAt (b);
			b = 0;
			w = 1;
		}
	}
	if (w > 1)
		a[j++] = abc.charAt (b);
	return a.join ('');
};
/*===========================================*/
/* Распаковка плана из строки.               */
/* Вызов: s - строка с упакованным планом.   */
/* Возврат: true - план распакован,          */
/*          false - ошибка распаковки плана. */
/*===========================================*/
boardmap.unpack = function (s) {
	var i = 0, j = 0, w = 33, b = 0, r = true,
		n = this.m.length,
		k = Math.ceil (n / 6);
	if (s.length == k) {
		while (0 <= b && i < n) {
			if (w > 32) {
				b = this.abc.indexOf (s.charAt (j++));
				w = 1;
			}
			this.m[i++] = (b & w) != 0;
			w *= 2;
		}
		if (b < 0)
			r = false;
	}
	else
		r = false;
	return r;
};
/*=================================================*/
/* Преобразование плана в строку для визуализации. */
/* Возврат: текстовое представление плана.         */
/*=================================================*/
boardmap.toString = function () {
	function mh (m, i) { return m[i]? "-": "."; }
	function mv (m, i, nc) { return m[nc - 1 + i]? "|": ":"; }
	var c, r, i, sv, sh, lines = new Array (2 * this.nr + 1);
	/* Ряды горизонтальных и вертикальных линий. */
	i = 0;
	for (r = 0; r < this.nr - 1; r++) {
		/* Текущий ряд. */
		sh = "";
		sv = "";
		for (c = 0; c < this.nc - 1; c++) {
			sh += " " + mh (this.m, i);
			sv += mv (this.m, i, this.nc) + " ";
			i++;
		}
		/* Закрывающая вертикальная черта. */
		sh += " ";
		sv += mv (this.m, i, this.nc);
		/* Фиксация ряда. */
		lines[2 * r] = "[" + sh + "]";
		lines[2 * r + 1] = "[" + sv + "]";
		/* Подготовка к следующему ряду. */
		i += this.nc;
	}
	/* Последний ряд горизонтальных линий. */
	sh = "";
	for (c = 0; c < this.nc - 1; c++) {
		sh += " " + mh (this.m, i);
		i++;
	}
	sh += " ";
	lines[2 * r] = "[" + sh + "]";
	return lines.join ("\n");
};