/*=============================*/
/* Дрэва мовы праграміравання. */
/*=============================*/
i18n.plTree.be = {
	"скачок": -1,
	"крок": -2,
	"паварот": -3,
	"калі": {
		"наперадзе": {
			"край,": {"то": 1},
			"не": {"край,": {"то": 2}}
		},
	},
	"інакш": 3,
	"пакуль": {
		"наперадзе": {
			"край,": {"паўтараць": 4},
			"не": {"край,": {"паўтараць": 5}}
		},
	},
	"канец": {
		"галінавання": 6,
		"цыкла": 7,
		"падпраграмы": 8
	},
	"падпраграма": {"!імя": 9},
	"зрабі": {"!імя": 10}
};
/*=================*/
/* Табліца радкоў. */
/*=================*/
i18n.strTable.be = {
	/*------------*/
	/* index.html */
	/*------------*/
	1000: "Выканаўца «Багоўка»",
	1001: "Ігар Сяргеевіч Арэшчанкаў",
	1002: "Праграма: ",
	1003: "версія: ",
	1004: "Распрацаваў: ",
	/*----------*/
	/* index.js */
	/*----------*/
	/* Пункт меню ды паведамленні аб выхадзе выканаўцы за межы вобласці малявання. */
	1: "скід",
	2: "АВАРЫЯ - выканаўца зышоў за межы дошкі.",
	3: "Націсніце [ESC] для вяртання ў зыходнае становішча.",
	/* Заголовак і інфармацыйнае паведамленне рэжыма №1 (непасроднае выкананне каманд). */
	4: "Рэжым №1: Непасроднае выкананне каманд.",
	5: "Націсніце [ESC], каб ачысціць дошку для малявання.",
	6: "Націсніце [TAB] для переходу ў рэжым праграміравання.",
	/* Заголовак і інфармацыйнае паведамленне рэжыма №2 (праграміраванне). */
	7: "Рэжым №2: Праграміраванне выканаўцы.",
	8: "Націсніце [ESC], каб выдаліць тэкст праграмы.",
	9: "Націсніце [TAB] для пераходу ў рэжым выканання праграмы.",
	/* Заголовак і інфармацыйнае паведамленне рэжыма №3 (выкананне праграмы). */
	10: "Рэжым №3: Выкананне праграмы.",
	11: "Націсніце [TAB] для переходу ў рэжым непасроднага выканання каманд.",
	/* Паведамленні аб паспяховым завяршэнні праграмы. */
	12: "+Выкананне праграмы паспяхова завершана.",
	13: "Выканана скачкоў: %1, крокаў: %2, паваротаў: %3.",
	14: "Усяго дзеянняў: %1.",
	/* Паведамленні пра спыненне выканання праграмы карыстальнікам. */
	15: "Праграма спынена.",
	16: "Выкананне праграмы спынена карыстальнікам.",
	/* Паведамленне пра спыненне адладкі праграмы карыстальнікам. */
	17: "-Адладка праграмы спынена карыстальнікам.",
	/* Пункты меню падрэжыму выканання праграмы. */
	18: "стой",
	19: "адладка",
	/* Паведамленне пра працяг выканання праграмы пасля адладкі. */
	20: "Праграма выконваецца…",
	/* Пункты меню падрэжиму адладкі праграмы. */
	21: "скід",
	22: "далей",
	23: "выканаць",
	/* Паведамленне пра пераход у режым адладкі праграмы. */
	24: "Ідзе адладка праграмы…",
	/* Тэкст, які ўводзіцца ў рэдактар пры выбары каманд "скачок", "крок", "паварот". */
	25: "скачок",
	26: "крок",
	27: "паварот",
	/* Тэкст, які ўводзіцца ў рэдактар пры ўдакладненні каманды "калі". */
	28: "наперадзе край, то",
	29: "наперадзе не край, то",
	/* Пункты меню падрэжыму ўдакладнення пункта меню "калі". */
	30: "…наперадзе край",
	31: "…наперадзе не край",
	/* Тэкст, які ўводзіцца ў рэдактар пры выбары каманд "калі" и "інакш". */
	32: "калі ",
	33: "інакш",
	/* Тэкст, які ўводзіцца ў рэдактар пры ўдакладненні каманды "пакуль". */
	34: "наперадзе край, паўтараць",
	35: "наперадзе не край, паўтараць",
	/* Пункты меню падрэжыму ўдакладнення пункта меню "пакуль". */
	36: "…наперадзе край",
	37: "…наперадзе не край",
	/* Тэкст, які вводится в редактор при выборе пункта меню "пока ". */
	38: "пока ",
	/* Текст, который ўводзіцца ў рэдактар пры выбары каманд "зрабі" и "падпраграма". */
	39: "зрабі ",
	40: "падпраграма ",
	/* Тэкст, які ўводзіцца ў рэдактар пры ўдакладненні каманды "канец". */
	41: "галінавання",
	42: "цыкла",
	43: "падпраграмы",
	/* Пункты меню падрэжыму ўдакладнення пункта меню "канец". */
	44: "…галінавання",
	45: "…цыкла",
	46: "…падпраграмы",
	/* Тэкст, які ўводзіцца ў рэдактар пры выбары пункта меню "канец". */
	47: "канец ",
	/* Пункты меню падрэжыму праграміравания для ўвода дадатковых каманд. */
	48: "калі…",
	49: "інакш",
	50: "пакуль…",
	51: "зрабі",
	52: "падпр",
	53: "канец…",
	54: "назад",
	/* Запыт пацвярджэння на ачыстку зместа редактара тэкста праграмы. */
	55: "Выдаліць праграму цэлкам?",
	/* Пункты меню рэжиму №1 (непасроднае выкананне каманд). */
	56: "скачок",
	57: "крок",
	58: "паварот",
	59: "скід",
	60: "праграміраванне",
	/* Пункты меню рэжыму №2 (праграміраванне). */
	61: "скачок",
	62: "крок",
	63: "паварот",
	64: "ачысціць",
	65: "выкананне",
	/* Пункты меню рэжыму №3 (выкананне праграмы). */
	66: "пуск",
	67: "адладка",
	68: "вынік",
	69: "скід",
	70: "камандаванне",
	/* Радок стану. */
	71: "Гук [Alt+s]:",
	72: "нарм.",
	73: "паш.",
	74: "няма",
	/* Час выканання праграмы. */
	75: "Час выканання: %1 сек.",
	/*------------*/
	/* program.js */
	/*------------*/
	101: "Сінтаксічная памылка.",
	102: "канец радка",
	103: "Памылка выканання праграмы.",
	104: "Адсутнічае каманда \"%1\".",
	105: "канец галінавання",
	106: "канец цыкла",
	107: "канец падпраграмы",
	108: "Збой выканаўцы.",
	109: "Перавышаны магчымы ўзровень укладзенасці канструкцый.",
	110: "\"інакш\" без папярэдняга \"калі\"",
	111: "Іншая каманда.",
	112: "\"канец галінавання\" без папярэдняга \"калі\"",
	113: "\"канец цыкла\" без папярэдняга \"пакуль\"",
	114: "\"канец падпраграмы\" без папярэдняга \"падпраграма\" або \"зрабі\"",
	115: "Вызначэнне падпраграмы не можа быць укладзена.",
	116: "Падпраграма \"%1\" не вызначана.",
	117: "Радок №%1 праграмы: %2",
	118: "Дасягнут канец тэкста праграмы.",
	119: "у пазіцыі №%1 выяўлена: ",
	120: "Чакалася: ",
	121: "Памылак не выяўлена"
};
