/*==============================*/
/* Объект - задача для решения. */
/*==============================*/
var task = new Object ();
/*=======================================================*/
/* Подготовка к работе с задачей.                        */
/* Вызов: nc - количество вертикальных линий (столбцов), */
/*        nr - количество горизонтальных линий (строк).  */
/*=======================================================*/
task.init = function (nc, nr) {
	var n = nr * (nc - 1) + nc * (nr - 1);
	this.nc = nc;	/* количество столбцов */
	this.nr = nr;	/* количество строк */
	this.remove ();
	this.m = new Array (n);
};
/*===============================*/
/* Удаление поставленной задачи. */
/*===============================*/
task.remove = function () {
	this.c0 = 0;	/* начальный столбец */
	this.r0 = 0;	/* начальный столбец */
	this.d0 = 0; 	/* начальное направление*/
	this.c1 = -1;	/* конечный столбец */
	this.r1 = -1;	/* конечный столбец */
	this.d1 = -1;	/* конечное направление */
};
/*========================================*/
/* Проверка, поставлена ли задача.        */
/* Возврат: true - задача поставлена,     */
/*          false - задача не поставлена. */
/*========================================*/
task.isset = function () {
	return this.d1 >= 0;
};
/*==================================================*/
/* Проверка правильности решения задачи.            */
/* Вызов: m - план рисунка,                         */
/*        c, r, d - конечное положение исполнителя. */
/* Возврат: объект с тремя полями:                  */
/*        n1 - количество незакрашенных линий,      */
/*        n2 - количество неправильных линий,       */
/*        ap - правильность позиции исполнителя.    */
/*==================================================*/
task.check = function (m, c, r, d) {
	var res = new Object ();
	n = this.m.length;
	if (m.length == n) {
		res.n1 = 0;
		res.n2 = 0;
		for (i = 0; i < n; i++)
			if (this.m[i] != m[i])
				if (this.m[i])
					res.n1++;
				else
					res.n2++;
	}
	else
		res.n1 = res.n2 = -1;
	res.ap = this.c1 == c && this.r1 == r && this.d1 == d;
	return res;
};
/*====================================================================*/
/* Распаковка условия задачи из строки.                               */
/* Вызов: s - строка с упакованным условием задачи,                   */
/*        abc - алфавит из 64 символов, который использован в строке. */
/* Возврат: true - условие задачи распаковано,                        */
/*          false - ошибка распаковки условия задачи.                 */
/*====================================================================*/
task.unpack = function (s, abc) {
	var i = 0, j = 0, w = 33, b = 0, r = true,
		n = this.m.length,
		l = s.length,
		k = Math.ceil (n / 6);
	/* Проверка допустимости упакованного условия задачи. */
	r = 6 + k == l;
	if (r)
		for (j = 0; j < l; j++)
			if (abc.indexOf (s.charAt (j)) < 0)
				r = false;
	/* Распаковка условия задачи. */
	if (r) {
		this.c0 = abc.indexOf (s.charAt (0));
		this.r0 = abc.indexOf (s.charAt (1));
		this.d0 = abc.indexOf (s.charAt (2));
		j = 3;

		while (i < n) {
			if (w > 32) {
				b = abc.indexOf (s.charAt (j++));
				w = 1;
			}
			this.m[i++] = (b & w) != 0;
			w *= 2;
		}
		this.c1 = abc.indexOf (s.charAt (l - 3));
		this.r1 = abc.indexOf (s.charAt (l - 2));
		this.d1 = abc.indexOf (s.charAt (l - 1));
	}
	return r;
};